Revit 2015 API
EnergyAnalysisSurface Class
 Analytical surface. The collection of analytic openings belonging to this analytical parent surface
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
public class EnergyAnalysisSurface : IDisposable
Visual Basic
Public Class EnergyAnalysisSurface _
	Implements IDisposable
Visual C++
public ref class EnergyAnalysisSurface : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.EnergyAnalysisSurface
See Also
EnergyAnalysisSurface Members
Autodesk.Revit.DB.Analysis Namespace